{
  "personName": "Yash Rastogi",
  "personField": "Software Development & Cybersecurity Enthusiast",
  "aboutString": "I have knowledge over vast domains of computer science viz. Artificial Intelligence, Cyber Security, Full Stack Web and Software Development and Database Systems which helps me to combine these skills at will. I can easily grasp technical skills and work with the latest technologies and practices. I intend to work with passion and commitment and hope to grow my career prospects while adding value to the organization.",
  "resumeUrl": "https://drive.google.com/file/d/1O4Faml0y_b1fvabz8n-evuU6S5t0AqBt/view?usp=sharing",
  "experienceData": [
    {
      "company": "Ernst & Young",
      "date": "October 2020 - July 2023",
      "subtitle": "Consultant - Cyber Security",
      "description": "•  Conducted application security testing for a global MNC using tools such as HCL AppScan, Burp Suite, Checkmarx, and Visual Studio\n•  Delivered successful Vulnerability Assessment and Penetration Testing (VAPT) projects for global clients, identifying critical vulnerabilities and achieving huge future cost savings\n•  Led the nation-wide Vulnerability Management program for one of the top telecom provider, involving meetings with senior stakeholders and automation of configuration audits using Python (resulting in a 20% increase in productivity).\n•  Automated manual tasks using Python, Pandas, Numpy, and other tools, leading to a 40% increase in productivity.\n•  Managed nationwide vulnerability scanning using Nessus, Tenable Security Center, and Linux Shell Scripts, contributing to a 25% increase in client satisfaction and improved cybersecurity practices\n•  Enhanced team skills and knowledge in application security testing and vulnerability management through hosting multiple knowledge transfer sessions, guiding 10+ employees"
    },
    {
      "company": "Ernst & Young",
      "date": "January 2020 – September 2020",
      "subtitle": "Intern - Cyber Security",
      "description": "•  Improved SIEM effectiveness by researching the internal and external telecom environment, studying telecom nodes, and reviewing whitepapers for potential edge cases in security breaches\n•  Achieved a 10% reduction in false positives, enhancing the accuracy of the Security Information and Event Management (SIEM) system\n•  Conducted audits on client data, ensuring compliance with ISO 27001:2013 Access Control and Asset Management standards"
    }
  ],
  "educationData": [
    {
      "name": "NIIT University",
      "date": "2016 - 2020",
      "subtitle": "Bachelor of Technology - Computer Science",
      "score": "7.85 CGPA"
    },
    {
      "name": "Delhi Public School Gurgaon",
      "date": "2013 - 2015",
      "subtitle": "Class Xth - XIIth",
      "score": ""
    }
  ],
  "skillsData": [
    "Flutter, Dart",
    "React, Redux",
    "Node.js, MongoDB",
    "Burp Suite, Acunetix",
    "nmap, SQLi",
    "Java - Spring MVC, Servlets, Swing, Core, Android Development",
    "C",
    "JavaScript, TypeScript, jQuery",
    "Python",
    "MATLAB",
    "Bash Shell"
  ],
  "projectsData": [
    {
      "image": "/images/project.jpg",
      "name": "Cloudy Cloud Storage Web SPA",
      "description": "Built a cloud storage application with MD5 hash based\n      deduplication on the MongoDB - Express - ReactJS - Node.js stack",
      "link": "https://nu-capstone-project.github.io/cloudy/#/",
      "linkType": "project"
    },
    {
      "image": "/images/project.jpg",
      "name": "Android Video Encryption and Sharing App",
      "description": "Created a secure video sharing app in which a user can share their\n      videos protected by AES encryption.",
      "link": "https://github.com/yashrastogi/securivo",
      "linkType": "source"
    },
    {
      "image": "/images/project.jpg",
      "name": "Restaurant Management/Food Ordering App",
      "description": "Developed a food ordering app for our local campus cafe that\n      allows the cafe to take orders remotely.",
      "link": "https://github.com/yashrastogi/CampusCafe",
      "linkType": "source"
    },
    {
      "image": "/images/project.jpg",
      "name": "Chess Web App",
      "description": "Developed a Chess game using web technologies which allows the\n      user to play the game anywhere and on any device.",
      "link": "https://yashrastogi.github.io/chessboard",
      "linkType": "project"
    },
    {
      "image": "/images/project.jpg",
      "name": "DES Swing",
      "description": "Manually implemented the DES algorithm utilising Java and Swing\n      framework that enables the user to encrypt text using DES\n      algorithm.",
      "link": "https://github.com/yashrastogi/DES-Swing",
      "linkType": "source"
    },
    {
      "image": "/images/project.jpg",
      "name": "Research & Development - Improving University network performance",
      "description": "Performed analysis on campus wireless network and improved\n      performance.",
      "linkType": "none"
    }
  ],
  "formspreeEndpoint": "https://formspree.io/f/xleaabeq",
  "footerLinks": [
    { "link": "https://github.com/yashrastogi", "iconClass": "fa-github" },
    { "link": "https://linkedin.com/in/yashrastogi-ml", "iconClass": "fa-linkedin" }
  ]
}
